import random

from Init_Screen import *

data_inv = (((0.478, 0.337, 0.185), (+0.3, -0.7, +0.7), (-0.3, +0.7, -0.3), (+0.2, +0.1, -0.5)),
            ((0.106, 0.530, 0.364), (-0.5, -0.3, +0.7), (+0.5, -0.5, +0.7), (+0.3, +0.5, -0.7)),
            ((0.415, 0.347, 0.237), (+0.3, -0.7, +0.7), (-0.3, +0.7, -0.3), (+0.4, +0.0, -0.5)),
            ((0.274, 0.346, 0.380), (+0.5, -0.7, +0.4), (-0.3, +0.7, -0.3), (-0.5, +0.2, +0.3)),
            ((0.437, 0.438, 0.125), (+0.6, -0.6, +0.4), (-0.6, +0.8, -0.3), (-0.3, +0.5, -0.3)),
            ((0.304, 0.435, 0.261), (+0.8, -0.7, +0.4), (-0.6, +0.4, +0.2), (-0.2, +0.6, -0.6)),
            ((0.422, 0.390, 0.188), (-0.5, +0.8, -0.3), (+0.7, -0.5, -0.3), (-0.3, +0.1, +0.7)),
            ((0.214, 0.357, 0.429), (+0.3, -0.2, +0.1), (-0.3, +0.4, -0.1), (+0.1, -0.2, +0.2)),
            ((0.222, 0.413, 0.365), (+0.4, -0.4, +0.3), (-0.2, +0.1, +0.1), (-0.1, +0.4, -0.3)),
            ((0.093, 0.463, 0.444), (+0.0, -0.6, +0.7), (-0.6, +0.0, +0.2), (+0.2, +0.8, -0.8)))

# Здесь 10 платежных матриц, как tuple 10 tuples of 4 tuples of 3 elements
cursor.hide()
inv = 1000

for year in range(1, 11):
    os.system('cls')
    choice = random.randint(0, 9)
    print(f'Вложение Капитала, год {year}')
    print()
    print(f'Капитал в начале года равен {inv}')
    print(f'Состояние рынка на {year} год:')
    print('    Ⅰ      Ⅱ      Ⅲ')
    for i, index in enumerate(data_inv[choice]):
        for j in index:
            print(f'{j: 7.3f}', end='')
        print('\n') if i == 0 else print()
    print()
    key = key_pressed('для продолжения нажмите Enter', 'enter')

key_pressed('Мы закончили. Нажмите Enter', 'enter')
