from Init_Screen import init_screen, hide, system, key_pressed

init_screen()
hide()
system('cls')
key_pressed('Дзэн Питона на русском...\nНажмите ♦Shift♦ для продолжения\n', 'shift')
print('''Красивое лучше, чем уродливое.
Явное лучше, чем неявное.
Простое лучше, чем сложное.
Сложное лучше, чем запутанное.
Плоское лучше, чем вложенное.
Разреженное лучше, чем плотное.
Читаемость важна.
Особые случаи не настолько особые, чтобы нарушать правила.
Хотя практичность важнее безупречности.
Ошибки никогда не должны замалчиваться.
Если не замалчиваются явно.
Встретив двусмысленность, отбрось искушение угадать.
Должен существовать один — и, желательно, только один
 — очевидный способ сделать это.
Хотя он поначалу может быть и не очевиден, если вы не голландец.
Сейчас лучше, чем никогда.
Хотя никогда зачастую лучше, чем прямо сейчас.
Если реализацию сложно объяснить, то идея плоха.
Если реализацию легко объяснить, то идея, возможно, хороша.
Пространства имён — отличная штука. Давайте делать их больше!''')
key_pressed('\nНажмите ♦Shift♦ для завершения', 'shift')
